In [1]:
import pandas as pd

v1 = [1958, 1962, 1970, 1994, 2002]
v2 = [1, 1, 2, 3, 5]
v3 = [10, 100, 1000, 5, 25]

df = pd.DataFrame({'v1': v1, 'v2':v2, 'v3':v3})

df

     v1  v2    v3
0  1958   1    10
1  1962   1   100
2  1970   2  1000
3  1994   3     5
4  2002   5    25

In [2]:
df[["v1"]]

     v1
0  1958
1  1962
2  1970
3  1994
4  2002

In [3]:
df[["v1","v3"]]

     v1    v3
0  1958    10
1  1962   100
2  1970  1000
3  1994     5
4  2002    25

In [4]:
# Acessando linhas
df.iloc[1]

v1    1962
v2       1
v3     100
Name: 1, dtype: int64

In [5]:
df.iloc[1][2]

100

In [6]:
df.iloc[1,2]

100

In [8]:
import os
os.chdir("Dados")

mtcars = pd.read_csv("mtcars.csv", delimiter = ";")

In [9]:
mtcars.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [10]:
mtcars.tail()

                 mpg  cyl   disp   hp  drat     wt  qsec  vs  am  gear  carb
Lotus Europa    30.4    4   95.1  113  3.77  1.513  16.9   1   1     5     2
Ford Pantera L  15.8    8  351.0  264  4.22  3.170  14.5   0   1     5     4
Ferrari Dino    19.7    6  145.0  175  3.62  2.770  15.5   0   1     5     6
Maserati Bora   15.0    8  301.0  335  3.54  3.570  14.6   0   1     5     8
Volvo 142E      21.4    4  121.0  109  4.11  2.780  18.6   1   1     4     2

In [11]:
columns = list(df)

columns

['v1', 'v2', 'v3']

In [12]:
mtcars.info()

<class 'pandas.core.frame.DataFrame'>
Index: 32 entries, Mazda RX4 to Volvo 142E
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mpg     32 non-null     float64
 1   cyl     32 non-null     int64
 2   disp    32 non-null     float64
 3   hp      32 non-null     int64
 4   drat    32 non-null     float64
 5   wt      32 non-null     float64
 6   qsec    32 non-null     float64
 7   vs      32 non-null     int64
 8   am      32 non-null     int64
 9   gear    32 non-null     int64
 10  carb    32 non-null     int64
dtypes: float64(5), int64(6)
memory usage: 3.0+ KB

In [13]:
mtcars.shape

(32, 11)

In [14]:
subset = mtcars[["mpg", "cyl"]]

In [15]:
subset.head()

                    mpg  cyl
Mazda RX4          21.0    6
Mazda RX4 Wag      21.0    6
Datsun 710         22.8    4
Hornet 4 Drive     21.4    6
Hornet Sportabout  18.7    8

In [16]:
subset_rows = mtcars.loc[['Hornet Sportabout', 'Merc 240D']]

subset_rows.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Hornet Sportabout,18.7,8,360.0,175,3.15,3.44,17.02,0,0,3,2
Merc 240D,24.4,4,146.7,62,3.69,3.19,20.00,1,0,4,2

In [22]:
subset_rows = mtcars.iloc[[2,3]]

subset_rows.head()

                 mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
Datsun 710      22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
Hornet 4 Drive  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1

In [23]:
mtcars.loc[["Ferrari Dino", "Maserati Bora", "Ford Pantera L"],["mpg", "hp"]]

                 mpg   hp
Ferrari Dino    19.7  175
Maserati Bora   15.0  335
Ford Pantera L  15.8  264

In [27]:
mtcars.iloc[[1],[1]]

               cyl
Mazda RX4 Wag    6